app/views/devise/registrations/edit.html.erb


	    <% @user.authentications.each do |authentication| %>
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" = 15