app/controllers/authentications_controller.rb

  def create
      omniauth = request.env["omniauth.auth"]
      authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])

      #if the user added this authenticatio before then sign in
      if authentication
        flash[:notice] = "Signed in successfully."
        sign_in_and_redirect(:user, authentication.user)

      # if the user didnt add this authentication before but he's an logged  user > add it
      elsif current_user
        current_user.authentications.create(:provider => omniauth ['provider'], :uid => omniauth['uid'])
        flash[:notice] = "Authentication successful."
        redirect_to authentications_url

      #sign up scenario if the user is not an existing user nor signed in ofcourse
      else

        if omniauth.provider.eql? "twitter"
          firstname = omniauth.info.name
          user = User.new({:firstname => firstname ,:thumbnail => omniauth.info.image})
        else
          user = User.new({:email => omniauth.info.email,:firstname => omniauth.info.first_name,:lastname => omniauth.info.last_name,:thumbnail => omniauth.info.image})
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'twitter' AND "authentications"."uid" = '158681231' LIMIT 1
INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 10 Jan 2013 18:45:21 UTC +00:00], ["provider", nil], ["uid", nil], ["updated_at", Thu, 10 Jan 2013 18:45:21 UTC +00:00], ["user_id", nil]]
INSERT INTO "users" ("authority", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "firstname", "last_sign_in_at", "last_sign_in_ip", "lastname", "location", "mobile", "pricture", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "thumbnail", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT 1 FROM "users" WHERE "users"."email" = 'hadyelsahar_2007@hotmail.com' LIMIT 1

  def destroy
    @authentication = current_user.authentications.find(params[:id])
    @authentication.destroy
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" = 1 AND "authentications"."id" = ? LIMIT 1  [["id", "7"]]
DELETE FROM "authentications" WHERE "authentications"."id" = ?  [["id", 7]]