app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" WHERE (cc > 700) AND (price > 3000) AND (price < 285000) AND (automatic = 't') AND (centerlock = 't') AND (abs = 't') AND (airbag = 't') AND (electricwindow = 't') AND (powersteering = 't')
---
      end

    else
      @cars = Car.all

INSERT INTO "cars" ("abs", "airbag", "automatic", "cc", "centerlock", "comment", "created_at", "electricwindow", "kmpassed", "mark", "model", "picture", "powersteering", "price", "thumbnailurl", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    p = params[:car]


    @car = Car.new(params[:car])
    @car.user = current_user
    logger.debug ">>>>   " + current_user.to_s

    respond_to do |format|
      if @car.save

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "cars" SET "price" = 35, "updated_at" = '2012-12-23 05:18:37.439775' WHERE "cars"."id" = 1
---
  def update
    @car = Car.find(params[:id])

    respond_to do |format|
      if @car.update_attributes(params[:car])