app/controllers/registrations_controller.rb

INSERT INTO "users" ("authority", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "firstname", "last_sign_in_at", "last_sign_in_ip", "lastname", "location", "mobile", "pricture", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "thumbnail", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "last_sign_in_at" = '2013-01-12 14:06:35.581015', "current_sign_in_at" = '2013-01-12 14:06:35.581015', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-01-12 14:06:35.583210' WHERE "users"."id" = 2
---
  def create
  super
    if  session[:omniauth] != nil
      omniauth =  session[:omniauth]
      @user.firstname = omniauth.info.name
      @user.thumbnail = omniauth.info.image
      @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 14 LIMIT 1
UPDATE "users" SET "thumbnail" = 'https://twimg0-a.akamaihd.net/profile_images/1312232609/download_bigger.jpg', "updated_at" = '2013-01-12 20:09:05.762083' WHERE "users"."id" = 14
---
  def update

    @user = User.find(current_user.id)

    if params[:user][:current_password].eql? @user.password or !@user.password_required?

      if params[:user][:password].blank?
        params[:user].delete("password")
        params[:user].delete("password_confirmation")
      end

      successfully_updated = @user.update_without_password(params[:user])