app/views/cars/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
		<%= image_tag @car.user.thumbnail %>
  		<%= @car.user.firstname + "\t" + @car.user.lastname  %>